#### Terraform Prod Format and Style 🖌 `success`
#### Terraform Prod Initialization ⚙️ `success`
#### Terraform Prod Validation 🤖 `success`
<details><summary>Prod Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Prod Plan 📖 `success`

<details><summary>Show Prod Plan</summary>

```

terraform
data.databricks_current_user.service_principal: Reading...
data.databricks_current_user.service_principal: Read complete after 1s [id=2380515200607506]
databricks_job.batch_inference_job: Refreshing state... [id=779596117538385]
databricks_job.model_training_job: Refreshing state... [id=211545828422415]
databricks_permissions.batch_job_permissions: Refreshing state... [id=/jobs/779596117538385]
databricks_mlflow_model.registered_model: Refreshing state... [id=prod-my-mlops-project-model]
databricks_permissions.training_job_permissions: Refreshing state... [id=/jobs/211545828422415]
databricks_permissions.mlflow_model_permissions: Refreshing state... [id=/registered-models/36ec535b32224925a1212ba6f1ad88ce]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # databricks_job.batch_inference_job will be updated in-place
  ~ resource "databricks_job" "batch_inference_job" {
        id                        = "779596117538385"
        name                      = "prod-my-mlops-project-batch-inference-job"
        # (8 unchanged attributes hidden)

      ~ new_cluster {
          ~ num_workers                  = 3 -> 1
            # (12 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      ~ notebook_task {
          ~ base_parameters = {
              ~ "input_table_name"  = "" -> "input_table_nyc"
              ~ "output_table_name" = "mymlopsproject_predictions" -> "prediction_table_nyc"
                # (1 unchanged element hidden)
            }
            # (1 unchanged attribute hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # databricks_mlflow_experiment.experiment will be created
  + resource "databricks_mlflow_experiment" "experiment" {
      + creation_time    = (known after apply)
      + description      = "MLflow Experiment used to track runs for my-mlops-project project."
      + experiment_id    = (known after apply)
      + id               = (known after apply)
      + last_update_time = (known after apply)
      + lifecycle_stage  = (known after apply)
      + name             = "/my-mlops-project/prod-my-mlops-project-experiment"
    }

  # databricks_permissions.mlflow_experiment_permissions will be created
  + resource "databricks_permissions" "mlflow_experiment_permissions" {
      + experiment_id = (known after apply)
      + id            = (known after apply)
      + object_type   = (known after apply)

      + access_control {
          + group_name       = "users"
          + permission_level = "CAN_READ"
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + my-mlops-project_experiment_id = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>